In [1]:
import numpy as np
import pandas as pd

# Numpy Questions

-4-

In [2]:
ar = np.zeros(10)
print(ar)

[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]

In [3]:
ar[6] = 11

In [4]:
print(ar)

[ 0.  0.  0.  0.  0.  0. 11.  0.  0.  0.]

-8-

In [5]:
ar1 = np.ones((5,5))

In [6]:
ar1[1:-1,1:-1] = 0

In [7]:
print(ar1)

[[1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1.]]

-9-

In [8]:
ar2 = np.ones((3,3))
ar2

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [9]:
ar2 = np.pad(ar2, pad_width=1, mode="constant", constant_values=0)

In [10]:
ar2

array([[0., 0., 0., 0., 0.],
       [0., 1., 1., 1., 0.],
       [0., 1., 1., 1., 0.],
       [0., 1., 1., 1., 0.],
       [0., 0., 0., 0., 0.]])

-10-

In [11]:
ar3 = np.zeros((8,8), dtype = int)
ar3

array([[0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0]])

In [12]:
ar3[1::2, ::2] = 1
ar3[::2, 1::2] = 1

In [13]:
ar3

array([[0, 1, 0, 1, 0, 1, 0, 1],
       [1, 0, 1, 0, 1, 0, 1, 0],
       [0, 1, 0, 1, 0, 1, 0, 1],
       [1, 0, 1, 0, 1, 0, 1, 0],
       [0, 1, 0, 1, 0, 1, 0, 1],
       [1, 0, 1, 0, 1, 0, 1, 0],
       [0, 1, 0, 1, 0, 1, 0, 1],
       [1, 0, 1, 0, 1, 0, 1, 0]])

-11-

In [14]:
mylist = [1,2,3,4,5,6,7,8]
mytuple = ([1,2,3],[4,6,8])

In [15]:
np.asarray(mylist)

array([1, 2, 3, 4, 5, 6, 7, 8])

In [16]:
np.asarray(mytuple)

array([[1, 2, 3],
       [4, 6, 8]])

-12-

In [17]:
arr4 = [[10,20,30]]

In [18]:
arr4 = np.append(arr4, [[40,50,60], [70,80,90]])

In [19]:
arr4

array([10, 20, 30, 40, 50, 60, 70, 80, 90])

-14-

In [20]:
fvalues = [0,12,45.21,34,99.91]
F = np.array(fvalues)
print(F)
V = (5*F/9 - 5*32/9)
print(V)

[ 0.   12.   45.21 34.   99.91]
[-17.77777778 -11.11111111   7.33888889   1.11111111  37.72777778]

# PANDAS QUESTIONS

2-Write a Pandas program to convert a Panda module Series to Python list and it's type.

In [21]:
ds = pd.Series([2, 4, 6, 8, 10])
ds

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [22]:
type(ds)

pandas.core.series.Series

In [23]:
ds.tolist()

[2, 4, 6, 8, 10]

In [24]:
type(ds.tolist())

list

3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [25]:
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])

In [26]:
ds1 + ds2

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [27]:
ds1 - ds2

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [28]:
ds1 * ds2

0     2
1    12
2    30
3    56
4    90
dtype: int64

In [29]:
ds1 / ds2

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

5. Write a Pandas program to convert a dictionary to a Pandas series.

In [30]:
d1 = {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':800}

In [31]:
d1

{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}

In [32]:
new_series = pd.Series(d1)

In [33]:
new_series

a    100
b    200
c    300
d    400
e    800
dtype: int64

6. Write a Pandas program to convert a NumPy array to a Pandas series.

In [34]:
np_array = np.array([10, 20, 30, 40, 50])

In [35]:
np_array

array([10, 20, 30, 40, 50])

In [36]:
new_series = pd.Series(np_array)

In [37]:
new_series

0    10
1    20
2    30
3    40
4    50
dtype: int32

13. Write a Pandas program to create a subset of a given series based on value and condition.

In [38]:
s = pd.Series([0, 1,2,3,4,5,6,7,8,9,10])

In [39]:
s

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [40]:
n = 6
new_s = s[s < n]

In [41]:
new_s

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

13. Write a Pandas program to calculate the sum of the examination attempts by the students.

First of all, let's copy "Exam data" dict and labels list given in the question and run them.

In [55]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

if we transform the exam data dict to Dataframe, we can see the data clearly.
For this let's use pandas Dataframe function, we can assign the labels list as an index.

In [56]:
df = pd.DataFrame(exam_data, index=labels)

In [57]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [58]:
df.attempts.sum()

19

15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [49]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [59]:
df = pd.DataFrame(exam_data, index=labels)

In [60]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
for adding a new row, we use loc method and
we should mention the new row name inside the method, then must write a list the other side of the equal sign.
this list's length must be equal with the column number of dataframe

In [61]:
df.loc["k"] = ["Suresh", 15.5, 1, "yes"]

In [62]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

if we want to permanent the change we make ,There are two ways
first one is we should equalize the code written for changing to dataframe's name again
or we can use inplace parameter inside the function

In [65]:
df = df.drop("k")
# df.drop("k", inplace=True)

In [66]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes